In [24]:
import pandas as pd
df=pd.read_csv("student.csv")
df

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No
3,4,Priya Iyer,NaN,Female,CIVIL,92.0,9.1,Bangalore,No,Yes
4,5,Siddharth Jain,24.0,NaN,EEE,48.5,5.3,Kolkata,Yes,No
5,6,Kavya Reddy,20.0,Female,CSE,90.3,8.9,NaN,Yes,Yes
6,7,Aman Kumar,22.0,Male,ECE,55.0,NaN,Chennai,No,No
7,8,Meena S,19.0,Female,MECH,81.2,7.5,Mumbai,NaN,Yes
8,9,Varun Raj,25.0,Male,NaN,88.8,9.0,Hyderabad,Yes,NaN
9,10,Nisha Das,18.0,Female,CIVIL,NaN,6.7,Pune,No,No

In [25]:
df.describe()

       StudentID        Age  Attendance      CGPA
count   10.00000   9.000000    9.000000  9.000000
mean     5.50000  21.555556   75.400000  7.677778
std      3.02765   2.297341   16.051012  1.311276
min      1.00000  18.000000   48.500000  5.300000
25%      3.25000  20.000000   65.100000  6.800000
50%      5.50000  22.000000   81.200000  7.500000
75%      7.75000  23.000000   88.800000  8.900000
max     10.00000  25.000000   92.000000  9.100000

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   StudentID       10 non-null     int64
 1   Name            10 non-null     object
 2   Age             9 non-null      float64
 3   Gender          9 non-null      object
 4   Department      9 non-null      object
 5   Attendance      9 non-null      float64
 6   CGPA            9 non-null      float64
 7   City            9 non-null      object
 8   HostelResident  9 non-null      object
 9   Scholarship     9 non-null      object
dtypes: float64(3), int64(1), object(6)
memory usage: 932.0+ bytes

In [27]:
df.isnull().sum()

StudentID         0
Name              0
Age               1
Gender            1
Department        1
Attendance        1
CGPA              1
City              1
HostelResident    1
Scholarship       1
dtype: int64

In [28]:
df.dtypes

StudentID           int64
Name               object
Age               float64
Gender             object
Department         object
Attendance        float64
CGPA              float64
City               object
HostelResident     object
Scholarship        object
dtype: object

In [29]:
df.shape

(10, 10)

In [31]:
df1=df.fillna("n")
df1

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No
3,4,Priya Iyer,n,Female,CIVIL,92.0,9.1,Bangalore,No,Yes
4,5,Siddharth Jain,24.0,n,EEE,48.5,5.3,Kolkata,Yes,No
5,6,Kavya Reddy,20.0,Female,CSE,90.3,8.9,n,Yes,Yes
6,7,Aman Kumar,22.0,Male,ECE,55.0,n,Chennai,No,No
7,8,Meena S,19.0,Female,MECH,81.2,7.5,Mumbai,n,Yes
8,9,Varun Raj,25.0,Male,n,88.8,9.0,Hyderabad,Yes,n
9,10,Nisha Das,18.0,Female,CIVIL,n,6.7,Pune,No,No

In [32]:
df2=df.fillna(5)
df2

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No
3,4,Priya Iyer,5.0,Female,CIVIL,92.0,9.1,Bangalore,No,Yes
4,5,Siddharth Jain,24.0,5,EEE,48.5,5.3,Kolkata,Yes,No
5,6,Kavya Reddy,20.0,Female,CSE,90.3,8.9,5,Yes,Yes
6,7,Aman Kumar,22.0,Male,ECE,55.0,5.0,Chennai,No,No
7,8,Meena S,19.0,Female,MECH,81.2,7.5,Mumbai,5,Yes
8,9,Varun Raj,25.0,Male,5,88.8,9.0,Hyderabad,Yes,5
9,10,Nisha Das,18.0,Female,CIVIL,5.0,6.7,Pune,No,No

In [33]:
#Dictionary
df1=df.fillna({'chol':1,'fbs':2})
df1.isnull().sum()
df1

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No
3,4,Priya Iyer,NaN,Female,CIVIL,92.0,9.1,Bangalore,No,Yes
4,5,Siddharth Jain,24.0,NaN,EEE,48.5,5.3,Kolkata,Yes,No
5,6,Kavya Reddy,20.0,Female,CSE,90.3,8.9,NaN,Yes,Yes
6,7,Aman Kumar,22.0,Male,ECE,55.0,NaN,Chennai,No,No
7,8,Meena S,19.0,Female,MECH,81.2,7.5,Mumbai,NaN,Yes
8,9,Varun Raj,25.0,Male,NaN,88.8,9.0,Hyderabad,Yes,NaN
9,10,Nisha Das,18.0,Female,CIVIL,NaN,6.7,Pune,No,No

In [34]:
#Carry forward
df1=df.ffill()
df1

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No
3,4,Priya Iyer,23.0,Female,CIVIL,92.0,9.1,Bangalore,No,Yes
4,5,Siddharth Jain,24.0,Female,EEE,48.5,5.3,Kolkata,Yes,No
5,6,Kavya Reddy,20.0,Female,CSE,90.3,8.9,Kolkata,Yes,Yes
6,7,Aman Kumar,22.0,Male,ECE,55.0,8.9,Chennai,No,No
7,8,Meena S,19.0,Female,MECH,81.2,7.5,Mumbai,No,Yes
8,9,Varun Raj,25.0,Male,MECH,88.8,9.0,Hyderabad,Yes,Yes
9,10,Nisha Das,18.0,Female,CIVIL,88.8,6.7,Pune,No,No

In [35]:
#Backward fill
df1=df.bfill()
df1

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No
3,4,Priya Iyer,24.0,Female,CIVIL,92.0,9.1,Bangalore,No,Yes
4,5,Siddharth Jain,24.0,Female,EEE,48.5,5.3,Kolkata,Yes,No
5,6,Kavya Reddy,20.0,Female,CSE,90.3,8.9,Chennai,Yes,Yes
6,7,Aman Kumar,22.0,Male,ECE,55.0,7.5,Chennai,No,No
7,8,Meena S,19.0,Female,MECH,81.2,7.5,Mumbai,Yes,Yes
8,9,Varun Raj,25.0,Male,CIVIL,88.8,9.0,Hyderabad,Yes,No
9,10,Nisha Das,18.0,Female,CIVIL,NaN,6.7,Pune,No,No

In [36]:
#Fill avg value
df1=df.interpolate()
df1

C:\Users\SRMVEC\AppData\Local\Temp\ipykernel_21456\2634936298.py:2: FutureWarning: DataFrame.interpolate with object dtype is deprecated and will raise in a future version. Call obj.infer_objects(copy=False) before interpolating instead.
  df1=df.interpolate()

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No
3,4,Priya Iyer,23.5,Female,CIVIL,92.0,9.1,Bangalore,No,Yes
4,5,Siddharth Jain,24.0,NaN,EEE,48.5,5.3,Kolkata,Yes,No
5,6,Kavya Reddy,20.0,Female,CSE,90.3,8.9,NaN,Yes,Yes
6,7,Aman Kumar,22.0,Male,ECE,55.0,8.2,Chennai,No,No
7,8,Meena S,19.0,Female,MECH,81.2,7.5,Mumbai,NaN,Yes
8,9,Varun Raj,25.0,Male,NaN,88.8,9.0,Hyderabad,Yes,NaN
9,10,Nisha Das,18.0,Female,CIVIL,88.8,6.7,Pune,No,No

In [38]:
#Drop NA row/column
df1=df.dropna()
df1

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No

In [39]:
df1

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Aarav Sharma,22.0,Male,CSE,85.2,8.6,Chennai,Yes,No
1,2,Ishita Verma,21.0,Female,ECE,72.5,7.2,Mumbai,No,Yes
2,3,Rahul Mehta,23.0,Male,MECH,65.1,6.8,Delhi,Yes,No